#+title: Rust Course
#+author: Dang Quang Vu
#+description: Rust languages courses

** Vector
- Vector là cấu trúc dữ liệu cho phép bạn lưu trữ nhiều dữ liệu tương tự như
  tuples nhưng các dữ liệu này phải có cùng kiểu dữ liệu, và bạn có thêm bớt
  thêm, xoá dữ liệu trong vector 1 cách dễ dàng.
#+begin_src rust
fn main() {
    let mut my_numbers = vec![1,2,3,4];
    my_numbers.push(5);
    println!("{:?}", my_numbers);

    let mut my_vec = Vec::new();
    my_vec.push(1);
    println!("{:?}", my_vec);
}
#+end_src

#+RESULTS:
: [1, 2, 3, 4, 5]
: [1]

- Recap:
  + Vectors cho phép bạn lưu trữ nhiều phần dữ liệu có cùng 1 kiểu dữ liệu.
  + Dữ liệu có thể dễ dàng được thêm, xoá.
  + vec! macro có thể được sử dụng để khởi tạo 1 vectors
  + Sử dụng for..in để tạo vòng lặp qua các items trong vectors.

- Examples:
  #+begin_src rust
fn main() {
    let my_vec = vec![10,20,30,40,50];
    for num in &my_vec {
        match num {
            40 => println!("40 ne"),
            _ => println!("ok"),
        }
    }
}
  #+end_src

  #+begin_src
  : ok
  : ok
  : ok
  : 40 ne
  : ok
  #+end_src

